# Pandas Series

git add .

git commit -m "Join Operations"

git push

In [64]:
import pandas as pd
import numpy as np

In [65]:
series = pd.Series(np.random.randint(10, 20, size = 10))
series.values

array([16, 15, 14, 13, 18, 15, 11, 18, 13, 12])

In [66]:
print(series.size, series.dtype, series.axes)

10 int32 [RangeIndex(start=0, stop=10, step=1)]

## Index Operations on Series

In [67]:
seriesIndex = pd.Series(np.random.randint(10, 20, size = 10), index = [np.arange(20,10,-1)])
print(seriesIndex)
seriesIndex = pd.Series(np.random.randint(10, 20, size = 5), index = ["a","b","c","d","e"])
print(seriesIndex)

20    11
19    13
18    12
17    16
16    16
15    18
14    19
13    10
12    16
11    18
dtype: int32
a    12
b    12
c    14
d    16
e    11
dtype: int32

In [68]:
seriesIndex["a":"c"]

a    12
b    12
c    14
dtype: int32

## Dict to Series

In [69]:
dict = {"key1":3, "key2":4, "key4":6}

In [70]:
dictSerie = pd.Series(dict)
dictSerie

key1    3
key2    4
key4    6
dtype: int64

## Concat Series

In [71]:
concatDictSeries = pd.concat([dictSerie, dictSerie])
print(concatDictSeries)

key1    3
key2    4
key4    6
key1    3
key2    4
key4    6
dtype: int64

# Pandas DataFrame

In [72]:
import pandas as pd
import numpy as np

In [73]:
firstDataFrame = pd.DataFrame(np.random.normal(20, 5, size = 10))
firstDataFrame

           0
0  15.686915
1  20.656587
2  29.193769
3  24.768348
4  24.286840
5  17.486783
6  22.169248
7  12.702155
8  21.614487
9  26.064834

In [74]:
matrix_df = pd.DataFrame(data = np.random.normal(30, 5, size = 9).reshape(3,3), 
                    index = ["var1", "var2", "var3"],
                    columns= ["colunm1", "colunm2", "colunm2"])
matrix_df

        colunm1    colunm2    colunm2
var1  27.758251  32.543587  32.465921
var2  24.198531  34.029286  27.236396
var3  23.658969  27.992273  26.024195

## Element Operations

In [75]:
import numpy as np
import pandas as pd

In [76]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)
dict = {"var1": s1, "var2": s2, "var3": s3}

In [77]:
dict_df = pd.DataFrame(dict, index = ["a","b","c","d","e"])
dict_df

   var1  var2  var3
a     1     2     5
b     2     1     6
c     0     1     8
d     4     9     6
e     5     0     2

In [78]:
dict_df[:"a"]

   var1  var2  var3
a     1     2     5

#### Silme

In [79]:
dict_df.drop("a", axis = 0) # horizonal

   var1  var2  var3
b     2     1     6
c     0     1     8
d     4     9     6
e     5     0     2

In [80]:
dict_df["var6"] = dict_df["var3"] * dict_df["var2"]
dict_df

   var1  var2  var3  var6
a     1     2     5    10
b     2     1     6     6
c     0     1     8     8
d     4     9     6    54
e     5     0     2     0

In [81]:
dict_df.drop("var6", axis = 1)

   var1  var2  var3
a     1     2     5
b     2     1     6
c     0     1     8
d     4     9     6
e     5     0     2

## loc & iloc methods

iloc: choosing default pyhton type 

loc : choosing definited pandas type

In [82]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    23    22    23
1    25    23     9
2     2     1    13
3     8     8    22
4    29     7    21
5     6    23     5
6    29    17     7
7     9     8    28
8    26    14    15
9    14    23    15

In [83]:
df.loc[0:3]

   var1  var2  var3
0    23    22    23
1    25    23     9
2     2     1    13
3     8     8    22

In [84]:
df.iloc[0:3]

   var1  var2  var3
0    23    22    23
1    25    23     9
2     2     1    13

In [85]:
df.iloc[0,0]

23

In [86]:
df.iloc[:3,:2]

   var1  var2
0    23    22
1    25    23
2     2     1

## Condition Choosing Element Operations

In [87]:
import pandas as pd
import numpy as np

In [89]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    21    17    13
1     2    25    21
2    24     3    28
3     1     1    26
4     9    22    21
5    12    28    27
6    16     3     8
7     1    29     5
8     8     1     7
9    19    11     6

In [93]:
df[(df.var1 > 15) & (df.var2 < 15)]

   var1  var2  var3
2    24     3    28
6    16     3     8
9    19    11     6

In [94]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
0    21    17
2    24     3
6    16     3
9    19    11

## Join Operations

In [96]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df2 = df1 + 99

In [97]:
pd.concat([df1,df2])

   var1  var2  var3
0     6    27     7
1    10    16    22
2    24    25    29
3    19    13    22
4    15    20     3
0   105   126   106
1   109   115   121
2   123   124   128
3   118   112   121
4   114   119   102

In [99]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})
                    
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [100]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim